app/Controllers/admin_dashboard.php

    public function index()
    {
        $userModel = new userModel();
        $data['users'] = $userModel->findAll();

        $facultyModel = new facultyModel();
        $data['teachers'] = $facultyModel->findAll();
---
SELECT *
FROM `users`
SELECT *
FROM `teachers`