app/Controllers/adminlogin.php

SELECT *
FROM `admin`
WHERE `name` = 'admin123'
 LIMIT 1
---
    public function ad_login()
    {
        $adminModel = new AdminModel();

        $name = $this->request->getPost('name');
        $password = $this->request->getPost('password');

        $result = $adminModel->where('name',$name)->first();