app/Models/FacultyModel.php

    public function insertValue($data)
    {
        $builder = $this->db->table("teachers");
        return $builder->insert($data);
---
INSERT INTO `teachers` (`tname`, `email`, `phone`, `gender`, `address`) VALUES ('Teacher11', 'tt@gmail.com', '9850000654', 'male', 'pune')